## 
## Cadence First Encounter "v07.10-p011_1 ((32bit) 10/29/2007 17:15 (Linux 2.4))"
## Mon Dec 13 10:00:37 2010
## 
set sdc_version 1.4
current_design EMC08
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_pins {EMC_PADS_INSTANCE/P_CLOCK_MEM/Y}]  -name MEMCLK -period 25 -waveform {0 12.5}
set_clock_latency -source -early -min  5 [get_clocks {MEMCLK}]
set_clock_latency -source -early -max  5 [get_clocks {MEMCLK}]
set_clock_latency -source -late -min  5 [get_clocks {MEMCLK}]
set_clock_latency -source -late -max  5 [get_clocks {MEMCLK}]
set_clock_transition  -rise -min 1 [get_clocks {MEMCLK}]
set_clock_transition  -rise -max 1 [get_clocks {MEMCLK}]
set_clock_transition  -fall -min 1 [get_clocks {MEMCLK}]
set_clock_transition  -fall -max 1 [get_clocks {MEMCLK}]
create_clock [get_pins {EMC_PADS_INSTANCE/P_CLOCK/Y}]  -name CLK -period 50 -waveform {0 25}
set_clock_latency -source -early -min  5 [get_clocks {CLK}]
set_clock_latency -source -early -max  5 [get_clocks {CLK}]
set_clock_latency -source -late -min  5 [get_clocks {CLK}]
set_clock_latency -source -late -max  5 [get_clocks {CLK}]
set_clock_transition  -rise -min 1 [get_clocks {CLK}]
set_clock_transition  -rise -max 1 [get_clocks {CLK}]
set_clock_transition  -fall -min 1 [get_clocks {CLK}]
set_clock_transition  -fall -max 1 [get_clocks {CLK}]
set_propagated_clock  [get_pins {EMC_PADS_INSTANCE/P_CLOCK/Y}]
set_propagated_clock  [get_pins {EMC_PADS_INSTANCE/P_CLOCK_MEM/Y}]
set_input_transition -rise -min 10  [get_ports {RESET_B}]
set_input_transition -fall -min 10  [get_ports {RESET_B}]
set_input_transition -rise -max 100  [get_ports {RESET_B}]
set_input_transition -fall -max 100  [get_ports {RESET_B}]
set_input_transition -rise -min 10  [get_ports {PHT}]
set_input_transition -fall -min 10  [get_ports {PHT}]
set_input_transition -rise -max 100  [get_ports {PHT}]
set_input_transition -fall -max 100  [get_ports {PHT}]
set_input_transition -rise -min 10  [get_ports {EA_B}]
set_input_transition -fall -min 10  [get_ports {EA_B}]
set_input_transition -rise -max 100  [get_ports {EA_B}]
set_input_transition -fall -max 100  [get_ports {EA_B}]
set_load -pin_load -max  1.5  [get_ports {PSEN_B}]
set_load -pin_load -min  1.5  [get_ports {PSEN_B}]
set_input_transition -rise -min 10  [get_ports {P3[0]}]
set_input_transition -fall -min 10  [get_ports {P3[0]}]
set_input_transition -rise -max 100  [get_ports {P3[0]}]
set_input_transition -fall -max 100  [get_ports {P3[0]}]
set_input_transition -rise -min 10  [get_ports {P3[1]}]
set_input_transition -fall -min 10  [get_ports {P3[1]}]
set_input_transition -rise -max 100  [get_ports {P3[1]}]
set_input_transition -fall -max 100  [get_ports {P3[1]}]
set_input_transition -rise -min 10  [get_ports {P3[2]}]
set_input_transition -fall -min 10  [get_ports {P3[2]}]
set_input_transition -rise -max 100  [get_ports {P3[2]}]
set_input_transition -fall -max 100  [get_ports {P3[2]}]
set_input_transition -rise -min 10  [get_ports {P3[3]}]
set_input_transition -fall -min 10  [get_ports {P3[3]}]
set_input_transition -rise -max 100  [get_ports {P3[3]}]
set_input_transition -fall -max 100  [get_ports {P3[3]}]
set_input_transition -rise -min 10  [get_ports {P3[4]}]
set_input_transition -fall -min 10  [get_ports {P3[4]}]
set_input_transition -rise -max 100  [get_ports {P3[4]}]
set_input_transition -fall -max 100  [get_ports {P3[4]}]
set_input_transition -rise -min 10  [get_ports {P3[5]}]
set_input_transition -fall -min 10  [get_ports {P3[5]}]
set_input_transition -rise -max 100  [get_ports {P3[5]}]
set_input_transition -fall -max 100  [get_ports {P3[5]}]
set_input_transition -rise -min 10  [get_ports {P3[6]}]
set_input_transition -fall -min 10  [get_ports {P3[6]}]
set_input_transition -rise -max 100  [get_ports {P3[6]}]
set_input_transition -fall -max 100  [get_ports {P3[6]}]
set_input_transition -rise -min 10  [get_ports {P3[7]}]
set_input_transition -fall -min 10  [get_ports {P3[7]}]
set_input_transition -rise -max 100  [get_ports {P3[7]}]
set_input_transition -fall -max 100  [get_ports {P3[7]}]
set_input_transition -rise -min 10  [get_ports {P2[0]}]
set_input_transition -fall -min 10  [get_ports {P2[0]}]
set_input_transition -rise -max 100  [get_ports {P2[0]}]
set_input_transition -fall -max 100  [get_ports {P2[0]}]
set_input_transition -rise -min 10  [get_ports {P2[1]}]
set_input_transition -fall -min 10  [get_ports {P2[1]}]
set_input_transition -rise -max 100  [get_ports {P2[1]}]
set_input_transition -fall -max 100  [get_ports {P2[1]}]
set_input_transition -rise -min 10  [get_ports {P2[2]}]
set_input_transition -fall -min 10  [get_ports {P2[2]}]
set_input_transition -rise -max 100  [get_ports {P2[2]}]
set_input_transition -fall -max 100  [get_ports {P2[2]}]
set_input_transition -rise -min 10  [get_ports {P2[3]}]
set_input_transition -fall -min 10  [get_ports {P2[3]}]
set_input_transition -rise -max 100  [get_ports {P2[3]}]
set_input_transition -fall -max 100  [get_ports {P2[3]}]
set_input_transition -rise -min 10  [get_ports {P2[4]}]
set_input_transition -fall -min 10  [get_ports {P2[4]}]
set_input_transition -rise -max 100  [get_ports {P2[4]}]
set_input_transition -fall -max 100  [get_ports {P2[4]}]
set_input_transition -rise -min 10  [get_ports {P2[5]}]
set_input_transition -fall -min 10  [get_ports {P2[5]}]
set_input_transition -rise -max 100  [get_ports {P2[5]}]
set_input_transition -fall -max 100  [get_ports {P2[5]}]
set_input_transition -rise -min 10  [get_ports {P2[6]}]
set_input_transition -fall -min 10  [get_ports {P2[6]}]
set_input_transition -rise -max 100  [get_ports {P2[6]}]
set_input_transition -fall -max 100  [get_ports {P2[6]}]
set_input_transition -rise -min 10  [get_ports {P2[7]}]
set_input_transition -fall -min 10  [get_ports {P2[7]}]
set_input_transition -rise -max 100  [get_ports {P2[7]}]
set_input_transition -fall -max 100  [get_ports {P2[7]}]
set_input_transition -rise -min 10  [get_ports {P1[0]}]
set_input_transition -fall -min 10  [get_ports {P1[0]}]
set_input_transition -rise -max 100  [get_ports {P1[0]}]
set_input_transition -fall -max 100  [get_ports {P1[0]}]
set_input_transition -rise -min 10  [get_ports {P1[1]}]
set_input_transition -fall -min 10  [get_ports {P1[1]}]
set_input_transition -rise -max 100  [get_ports {P1[1]}]
set_input_transition -fall -max 100  [get_ports {P1[1]}]
set_input_transition -rise -min 10  [get_ports {P1[2]}]
set_input_transition -fall -min 10  [get_ports {P1[2]}]
set_input_transition -rise -max 100  [get_ports {P1[2]}]
set_input_transition -fall -max 100  [get_ports {P1[2]}]
set_input_transition -rise -min 10  [get_ports {P1[3]}]
set_input_transition -fall -min 10  [get_ports {P1[3]}]
set_input_transition -rise -max 100  [get_ports {P1[3]}]
set_input_transition -fall -max 100  [get_ports {P1[3]}]
set_input_transition -rise -min 10  [get_ports {P1[4]}]
set_input_transition -fall -min 10  [get_ports {P1[4]}]
set_input_transition -rise -max 100  [get_ports {P1[4]}]
set_input_transition -fall -max 100  [get_ports {P1[4]}]
set_input_transition -rise -min 10  [get_ports {P1[5]}]
set_input_transition -fall -min 10  [get_ports {P1[5]}]
set_input_transition -rise -max 100  [get_ports {P1[5]}]
set_input_transition -fall -max 100  [get_ports {P1[5]}]
set_input_transition -rise -min 10  [get_ports {P1[6]}]
set_input_transition -fall -min 10  [get_ports {P1[6]}]
set_input_transition -rise -max 100  [get_ports {P1[6]}]
set_input_transition -fall -max 100  [get_ports {P1[6]}]
set_input_transition -rise -min 10  [get_ports {P1[7]}]
set_input_transition -fall -min 10  [get_ports {P1[7]}]
set_input_transition -rise -max 100  [get_ports {P1[7]}]
set_input_transition -fall -max 100  [get_ports {P1[7]}]
set_input_transition -rise -min 10  [get_ports {P0[0]}]
set_input_transition -fall -min 10  [get_ports {P0[0]}]
set_input_transition -rise -max 100  [get_ports {P0[0]}]
set_input_transition -fall -max 100  [get_ports {P0[0]}]
set_input_transition -rise -min 10  [get_ports {P0[1]}]
set_input_transition -fall -min 10  [get_ports {P0[1]}]
set_input_transition -rise -max 100  [get_ports {P0[1]}]
set_input_transition -fall -max 100  [get_ports {P0[1]}]
set_input_transition -rise -min 10  [get_ports {P0[2]}]
set_input_transition -fall -min 10  [get_ports {P0[2]}]
set_input_transition -rise -max 100  [get_ports {P0[2]}]
set_input_transition -fall -max 100  [get_ports {P0[2]}]
set_input_transition -rise -min 10  [get_ports {P0[3]}]
set_input_transition -fall -min 10  [get_ports {P0[3]}]
set_input_transition -rise -max 100  [get_ports {P0[3]}]
set_input_transition -fall -max 100  [get_ports {P0[3]}]
set_input_transition -rise -min 10  [get_ports {P0[4]}]
set_input_transition -fall -min 10  [get_ports {P0[4]}]
set_input_transition -rise -max 100  [get_ports {P0[4]}]
set_input_transition -fall -max 100  [get_ports {P0[4]}]
set_input_transition -rise -min 10  [get_ports {P0[5]}]
set_input_transition -fall -min 10  [get_ports {P0[5]}]
set_input_transition -rise -max 100  [get_ports {P0[5]}]
set_input_transition -fall -max 100  [get_ports {P0[5]}]
set_input_transition -rise -min 10  [get_ports {P0[6]}]
set_input_transition -fall -min 10  [get_ports {P0[6]}]
set_input_transition -rise -max 100  [get_ports {P0[6]}]
set_input_transition -fall -max 100  [get_ports {P0[6]}]
set_input_transition -rise -min 10  [get_ports {P0[7]}]
set_input_transition -fall -min 10  [get_ports {P0[7]}]
set_input_transition -rise -max 100  [get_ports {P0[7]}]
set_input_transition -fall -max 100  [get_ports {P0[7]}]
set_max_capacitance 1000  [get_ports {CLOCK}]
set_max_fanout 20  [get_ports {CLOCK}]
set_max_capacitance 1000  [get_ports {CLOCK_MEM}]
set_max_fanout 20  [get_ports {CLOCK_MEM}]
set_max_capacitance 1000  [get_ports {RESET_B}]
set_max_fanout 20  [get_ports {RESET_B}]
set_max_capacitance 1000  [get_ports {PHT}]
set_max_fanout 20  [get_ports {PHT}]
set_max_capacitance 1000  [get_ports {EA_B}]
set_max_fanout 20  [get_ports {EA_B}]
set_max_capacitance 1000  [get_ports {TM}]
set_max_fanout 20  [get_ports {TM}]
set_wire_load_mode enclosed
set_clock_uncertainty 0.1 [get_clocks {CLK}]
set_clock_uncertainty 0.1 [get_clocks {MEMCLK}]
